//=============================================================================
// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму
// натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120  ; M = 4; N = 8. -> 30
//-----------------------------------------------------------------------------

int SumElement(int m, int n)
{
    if( n >= m ) return n + SumElement(m,n - 1);
    else return 0;
}

/*
Console.Write("Введите число m: ");
int m = Convert.ToInt32( Console.ReadLine() );
Console.Write("Введите число n: ");
int n = Convert.ToInt32( Console.ReadLine() );
Console.Write("Сумма элементов от m до n = " + SumElement(m, n));
*/

//=============================================================================
// Задача 67: Напишите программу, которая будет принимать на вход число и
// возвращать кол-во его цифр.
// 453 -> 3 ; 45 -> 2
//-----------------------------------------------------------------------------

int CountDigits(int num)
{
    if( num > 0 ) return 1 + CountDigits(num/10);
    return 0;
}

Console.Write("Введите число n: ");
int n = Convert.ToInt32( Console.ReadLine() );
Console.Write($"Количество цифр в числе {n} = " + CountDigits(n));